УчетВУправляющихДляГит1/src/AccumulationRegisters/РасходыПриУСН/РасходыПриУСН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасходыПриУСН</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЭтапПроведения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСписания</name>
    <type>
      <types>EnumRef.ОтражениеВУСН</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусыОплатыРасходовУСН</name>
    <type>
      <types>EnumRef.СтатусыРасходовУСН</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
      <types>DocumentRef.СписаниеОС</types>
      <types>DocumentRef.ОтражениеЗарплатыВБухучете</types>
      <types>DocumentRef.СписаниеСРасчетногоСчета</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ГТДИмпорт</types>
      <types>DocumentRef.ВыкупПредметовЛизинга</types>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ВыдачаДенежныхДокументов</types>
      <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
      <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
      <types>DocumentRef.НачислениеПеней</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ОперацияБух</types>
      <types>DocumentRef.УдалитьНачислениеЗарплатыРаботникамОрганизаций</types>
      <types>DocumentRef.ПоступлениеДенежныхДокументов</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ПоступлениеНМА</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ОтражениеЗарплатыВУчете</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ОперацияСБилетом</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.Отпуск</types>
      <types>DocumentRef.ОплатаПлатежнойКартой</types>
      <types>DocumentRef.ТребованиеНакладная</types>
      <types>DocumentRef.БольничныйЛист</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.ВводНачальныхОстатков</types>
      <types>DocumentRef.ПередачаОборудованияВМонтаж</types>
      <types>DocumentRef.ПередачаНМА</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.РегламентнаяОперация</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РасходыПредпринимателя</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
      <types>DocumentRef.НачислениеЗарплаты</types>
      <types>DocumentRef.ЗаявлениеОВвозеТоваров</types>
      <types>DocumentRef.УдалитьОтражениеЗарплатыВУчете</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ИнвентаризацияНЗП</types>
      <types>DocumentRef.ИнвентаризацияТоваровНаСкладе</types>
      <types>DocumentRef.УдалитьРасчетЕСН</types>
      <types>DocumentRef.ЗаписьКУДиР</types>
      <types>DocumentRef.ПеремещениеОС</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
      <types>DocumentRef.СписаниеНМА</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
      <types>DocumentRef.СписаниеОС</types>
      <types>DocumentRef.СписаниеСРасчетногоСчета</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ГТДИмпорт</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.ВыкупПредметовЛизинга</types>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.РегистрацияОплатыОсновныхСредствДляУСН</types>
      <types>DocumentRef.ПередачаМатериаловВЭксплуатацию</types>
      <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
      <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
      <types>DocumentRef.НачислениеПеней</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ОперацияБух</types>
      <types>DocumentRef.УдалитьНачислениеЗарплатыРаботникамОрганизаций</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ПоступлениеНМА</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ОтражениеЗарплатыВУчете</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ОказаниеУслуг</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ОплатаПлатежнойКартой</types>
      <types>DocumentRef.ТребованиеНакладная</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.КВП_ОтражениеНачисленийВРеглУчете</types>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.ПередачаОборудованияВМонтаж</types>
      <types>DocumentRef.ПередачаНМА</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РасходыПредпринимателя</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
      <types>DocumentRef.ЗаявлениеОВвозеТоваров</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
      <types>DocumentRef.УдалитьОтражениеЗарплатыВУчете</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ИнвентаризацияНЗП</types>
      <types>DocumentRef.ПартияМатериаловВЭксплуатации</types>
      <types>DocumentRef.ИнвентаризацияТоваровНаСкладе</types>
      <types>DocumentRef.УдалитьРасчетЕСН</types>
      <types>DocumentRef.РеализацияОтгруженныхТоваров</types>
      <types>DocumentRef.ВозвратМатериаловИзЭксплуатации</types>
      <types>DocumentRef.ПеремещениеОС</types>
      <types>DocumentRef.Партия</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
      <types>DocumentRef.СписаниеНМА</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасхода</name>
    <type>
      <types>EnumRef.ВидыРасходовУСН</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементРасхода</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
      <types>CatalogRef.НематериальныеАктивы</types>
      <types>CatalogRef.Билеты</types>
      <types>CatalogRef.РасходыБудущихПериодов</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусыПартийУСН</name>
    <type>
      <types>EnumRef.СтатусыПартийУСН</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтражениеВУСН</name>
    <type>
      <types>EnumRef.ОтражениеВУСН</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСтрокиДокумента</name>
    <comment>Определяет порядок оплаты расходов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РеквизитыДокументаОплаты</name>
    <type>
      <types>DocumentRef.ОтражениеЗарплатыВБухучете</types>
      <types>DocumentRef.СписаниеСРасчетногоСчета</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ВыдачаДенежныхДокументов</types>
      <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
      <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ОперацияБух</types>
      <types>DocumentRef.УдалитьНачислениеЗарплатыРаботникамОрганизаций</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ОтражениеЗарплатыВУчете</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ПередачаТоваров</types>
      <types>DocumentRef.Отпуск</types>
      <types>DocumentRef.ОплатаПлатежнойКартой</types>
      <types>DocumentRef.БольничныйЛист</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.ВводНачальныхОстатков</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РасходыПредпринимателя</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.УдалитьОтражениеЗарплатыВУчете</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.УдалитьРасчетЕСН</types>
      <types>DocumentRef.РеализацияОтгруженныхТоваров</types>
      <types>DocumentRef.ВозвратМатериаловИзЭксплуатации</types>
      <types>DocumentRef.Партия</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УчетВУправляющихДляГит1/src/AccumulationRegisters/РасходыПриУСН/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

Процедура ЗаменитьСчетПФР_ОПС_ИП() Экспорт
	
	СчетУчетаУдаленный = ПланыСчетов.Хозрасчетный.УдалитьПФР_ОПС_ИП;
	СчетУчетаНовый     = ПланыСчетов.Хозрасчетный.ПФР_ОПС_ИП;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетУчетаУдаленный", СчетУчетаУдаленный);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходыПриУСН.Регистратор
	|ИЗ
	|	РегистрНакопления.РасходыПриУСН КАК РасходыПриУСН
	|ГДЕ
	|	РасходыПриУСН.СчетУчета = &СчетУчетаУдаленный";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыНакопления.РасходыПриУСН.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Значение = Выборка.Регистратор;
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Если Запись.СчетУчета = СчетУчетаУдаленный Тогда
				Запись.СчетУчета = СчетУчетаНовый;
			КонецЕсли;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
